## 1. 데이터 불러오기

In [4]:
import pandas as pd 

df1 = pd.read_csv('sales_data.csv',encoding='utf-8-sig')
df1

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00
3,1004,Daisy,Female,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00
4,1005,Ethan,Male,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00

In [12]:
import json 

with open('country_info.json','r',encoding='utf-8-sig') as json_file:
    json_data = json.load(json_file)

In [14]:
json_data

{'USA': {'Capital': 'Washington D.C.',
  'Population': 331002651,
  'Currency': 'USD'},
 'Korea': {'Capital': 'Seoul', 'Population': 51780579, 'Currency': 'KRW'},
 'Canada': {'Capital': 'Ottawa', 'Population': 37742154, 'Currency': 'CAD'}}

## 2-1 series

In [53]:
시리즈=pd.Series([80,90,100], index=['국','영','수'])
시리즈

국     80
영     90
수    100
dtype: int64

In [55]:
# index 수정
시리즈.index=['화','미','체']
print(시리즈)

# 삭제
del 시리즈['화']
print(시리즈)

화     80
미     90
체    100
dtype: int64
미     90
체    100
dtype: int64

In [95]:
# 타입변환 
print(시리즈.dtype)

print('\n변환 후')
print(시리즈.astype('float64'))

print('\n일부만 변환')
시리즈['미']=int(시리즈['미'])
시리즈.dtype

int64

변환 후
미     90.0
체    100.0
dtype: float64

일부만 변환

dtype('int64')

## 2-2 DataFrame

In [230]:
# dataframe 만들기
국가=pd.DataFrame({'한국':[1,2,3,4],'미국':[5,5,5,7]},index=['1주','2주','3주','4주'])
국가

    한국  미국
1주   1   5
2주   2   5
3주   3   5
4주   4   7

In [232]:
display(국가.index)
display(국가.values)
display(국가.columns)

Index(['1주', '2주', '3주', '4주'], dtype='object')

array([[1, 5],
       [2, 5],
       [3, 5],
       [4, 7]], dtype=int64)

Index(['한국', '미국'], dtype='object')

In [234]:
# 데이터프레임 수정

국가.index=['1달','2달','3달','4달']
국가.columns=['중국','일본']
국가['프랑스']=[7,7,4,5]
국가

    중국  일본  프랑스
1달   1   5    7
2달   2   5    7
3달   3   5    4
4달   4   7    5

In [236]:
# 특정 열을 인덱스화 
# 1. 원본에서 set_index만 적용한 버전
국가_인덱스 = 국가.set_index('프랑스')
display(국가_인덱스)

# 2. 인덱스 이름을 바꾼 후 버전
국가_인덱스.index.name = '프랑스에서바뀜'
display(국가_인덱스)

#3. 인덱스에서 다시 칼럼으로

국가_인덱스=국가_인덱스.reset_index('프랑스에서바뀜')
display(국가_인덱스)

     중국  일본
프랑스
7     1   5
7     2   5
4     3   5
5     4   7

         중국  일본
프랑스에서바뀜
7         1   5
7         2   5
4         3   5
5         4   7

   프랑스에서바뀜  중국  일본
0        7   1   5
1        7   2   5
2        4   3   5
3        5   4   7

## 3.데이터 접근하기
### loc,iloc

In [238]:
국가

    중국  일본  프랑스
1달   1   5    7
2달   2   5    7
3달   3   5    4
4달   4   7    5

In [240]:
display(국가.loc['2달':'3달','중국':'중국'])
display(국가.loc['4달'])
display(국가.loc[:,'일본'])

    중국
2달   2
3달   3

중국     4
일본     7
프랑스    5
Name: 4달, dtype: int64

1달    5
2달    5
3달    5
4달    7
Name: 일본, dtype: int64

In [244]:
display(국가.iloc[0:3])
display(국가.iloc[1:3])

    중국  일본  프랑스
1달   1   5    7
2달   2   5    7
3달   3   5    4

    중국  일본  프랑스
2달   2   5    7
3달   3   5    4

In [248]:
# 행추가
국가.loc['5달']=[9,9,9]
국가

    중국  일본  프랑스
1달   1   5    7
2달   2   5    7
3달   3   5    4
4달   4   7    5
5달   9   9    9

In [250]:
#행삭제
국가.drop(['5달'])

    중국  일본  프랑스
1달   1   5    7
2달   2   5    7
3달   3   5    4
4달   4   7    5